[Timeout] BlockStatement
src/main/routes/api.js:6:38
 
 const router = express.Router()
 
-router.get('/health', (_req, res) => {
-  res.json({ status: 'ok' })
-})
+router.get('/health', (_req, res) => {})
 
 router.post('/calculate', (req, res) => {

[Timeout] BlockStatement
src/main/routes/api.js:10:41
   res.json({ status: 'ok' })
 })
 
-router.post('/calculate', (req, res) => {
-  try {
-    const { price, discountRate, taxRate } = req.body ?? {}
-    const result = calculatePricing({ price, discountRate, taxRate })
-    res.json({ ok: true, result })
-  } catch (err) {
-    res.status(400).json({
-      ok: false,
-      error: {
-        name: err?.name ?? 'Error',
-        message: err?.message ?? 'Bad Request'
-      }
-    })
-  }
-})
+router.post('/calculate', (req, res) => {})
 
 export { router as apiRouter }

[Timeout] BlockStatement
src/main/routes/api.js:11:7
 })
 
 router.post('/calculate', (req, res) => {
-  try {
-    const { price, discountRate, taxRate } = req.body ?? {}
-    const result = calculatePricing({ price, discountRate, taxRate })
-    res.json({ ok: true, result })
-  } catch (err) {
+  try {} catch (err) {
     res.status(400).json({
       ok: false,

[Killed] LogicalOperator
src/main/routes/api.js:12:46
 
 router.post('/calculate', (req, res) => {
   try {
-    const { price, discountRate, taxRate } = req.body ?? {}
+    const { price, discountRate, taxRate } = req.body && {}
     const result = calculatePricing({ price, discountRate, taxRate })
     res.json({ ok: true, result })
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BooleanLiteral
src/main/routes/api.js:14:20
   try {
     const { price, discountRate, taxRate } = req.body ?? {}
     const result = calculatePricing({ price, discountRate, taxRate })
-    res.json({ ok: true, result })
+    res.json({ ok: false, result })
   } catch (err) {
     res.status(400).json({
killedBy: api POST /api/calculate calculates pricing
statusReason: expected false to equal true

[Timeout] BlockStatement
src/main/routes/api.js:15:17
     const { price, discountRate, taxRate } = req.body ?? {}
     const result = calculatePricing({ price, discountRate, taxRate })
     res.json({ ok: true, result })
-  } catch (err) {
-    res.status(400).json({
-      ok: false,
-      error: {
-        name: err?.name ?? 'Error',
-        message: err?.message ?? 'Bad Request'
-      }
-    })
-  }
+  } catch (err) {}
 })
 

[Killed] BooleanLiteral
src/main/routes/api.js:17:11
     res.json({ ok: true, result })
   } catch (err) {
     res.status(400).json({
-      ok: false,
+      ok: true,
       error: {
         name: err?.name ?? 'Error',
killedBy: api POST /api/calculate returns 400 on invalid payload
statusReason: expected true to equal false

[Survived] OptionalChaining
src/main/routes/api.js:19:15
     res.status(400).json({
       ok: false,
       error: {
-        name: err?.name ?? 'Error',
+        name: err.name ?? 'Error',
         message: err?.message ?? 'Bad Request'
       }

[Survived] LogicalOperator
src/main/routes/api.js:19:15
     res.status(400).json({
       ok: false,
       error: {
-        name: err?.name ?? 'Error',
+        name: err?.name && 'Error',
         message: err?.message ?? 'Bad Request'
       }

[Survived] OptionalChaining
src/main/routes/api.js:20:18
       ok: false,
       error: {
         name: err?.name ?? 'Error',
-        message: err?.message ?? 'Bad Request'
+        message: err.message ?? 'Bad Request'
       }
     })

[Survived] LogicalOperator
src/main/routes/api.js:20:18
       ok: false,
       error: {
         name: err?.name ?? 'Error',
-        message: err?.message ?? 'Bad Request'
+        message: err?.message && 'Bad Request'
       }
     })
