[Killed] BlockStatement
src/main/server.js:9:23
 const __filename = fileURLToPath(import.meta.url)
 const __dirname = path.dirname(__filename)
 
-function createApp () {
-  const app = express()
-
-  app.use(express.json())
-
-  app.use('/api', apiRouter)
-
-  app.use(express.static(path.join(__dirname, '../public')))
-
-  return app
-}
+function createApp () {}
 
 function startServer () {
killedBy: api GET /api/health returns ok
statusReason: Cannot read properties of undefined (reading 'address')

[NoCoverage] BlockStatement
src/main/server.js:21:25
   return app
 }
 
-function startServer () {
-  const app = createApp()
-  const port = Number.parseInt(process.env.PORT ?? '8080', 10)
-  app.listen(port, () => {
-    console.log(`Web server running at http://localhost:${port}`)
-  })
-}
+function startServer () {}
 
 export { createApp, startServer }

[NoCoverage] LogicalOperator
src/main/server.js:23:32
 
 function startServer () {
   const app = createApp()
-  const port = Number.parseInt(process.env.PORT ?? '8080', 10)
+  const port = Number.parseInt(process.env.PORT && '8080', 10)
   app.listen(port, () => {
     console.log(`Web server running at http://localhost:${port}`)

[NoCoverage] StringLiteral
src/main/server.js:23:52
 
 function startServer () {
   const app = createApp()
-  const port = Number.parseInt(process.env.PORT ?? '8080', 10)
+  const port = Number.parseInt(process.env.PORT ?? "", 10)
   app.listen(port, () => {
     console.log(`Web server running at http://localhost:${port}`)

[NoCoverage] BlockStatement
src/main/server.js:24:26
 function startServer () {
   const app = createApp()
   const port = Number.parseInt(process.env.PORT ?? '8080', 10)
-  app.listen(port, () => {
-    console.log(`Web server running at http://localhost:${port}`)
-  })
+  app.listen(port, () => {})
 }
 
