[Killed] BlockStatement
src/main/calculator.js:8:50
  * @param {number} discountRate - Discount rate between 0 and 1
  * @returns {number} Final price
  */
-function calculateDiscount (price, discountRate) {
-  if (price < 0) {
-    throw new Error('Price cannot be negative')
-  }
-  if (discountRate < 0) {
-    throw new Error('Discount rate must be between 0 and 1')
-  }
-
-  const discountAmount = price * discountRate
-  const finalPrice = price - discountAmount
-
-  if (finalPrice < 0) {
-    return 0
-  }
-
-  return finalPrice
-}
+function calculateDiscount (price, discountRate) {}
 
 export { calculateDiscount }
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BlockStatement
src/main/calculator.js:9:18
  * @returns {number} Final price
  */
 function calculateDiscount (price, discountRate) {
-  if (price < 0) {
-    throw new Error('Price cannot be negative')
-  }
+  if (price < 0) {}
   if (discountRate < 0) {
     throw new Error('Discount rate must be between 0 and 1')
killedBy: calculateDiscount throws an error for negative price
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/main/calculator.js:9:7
  * @returns {number} Final price
  */
 function calculateDiscount (price, discountRate) {
-  if (price < 0) {
+  if (false) {
     throw new Error('Price cannot be negative')
   }
killedBy: calculateDiscount throws an error for negative price
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/main/calculator.js:10:21
  */
 function calculateDiscount (price, discountRate) {
   if (price < 0) {
-    throw new Error('Price cannot be negative')
+    throw new Error("")
   }
   if (discountRate < 0) {
killedBy: calculateDiscount throws an error for negative price
statusReason: expected [Function] to throw error including 'Price cannot be negative' but got ''

[Killed] EqualityOperator
src/main/calculator.js:12:7
   if (price < 0) {
     throw new Error('Price cannot be negative')
   }
-  if (discountRate < 0) {
+  if (discountRate >= 0) {
     throw new Error('Discount rate must be between 0 and 1')
   }
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/main/calculator.js:12:7
   if (price < 0) {
     throw new Error('Price cannot be negative')
   }
-  if (discountRate < 0) {
+  if (false) {
     throw new Error('Discount rate must be between 0 and 1')
   }
killedBy: calculateDiscount throws an error for invalid discount rate
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/main/calculator.js:16:26
     throw new Error('Discount rate must be between 0 and 1')
   }
 
-  const discountAmount = price * discountRate
+  const discountAmount = price / discountRate
   const finalPrice = price - discountAmount
 
killedBy: api POST /api/calculate calculates pricing
statusReason: expected +0 to equal 90

[Killed] ArithmeticOperator
src/main/calculator.js:17:22
   }
 
   const discountAmount = price * discountRate
-  const finalPrice = price - discountAmount
+  const finalPrice = price + discountAmount
 
   if (finalPrice < 0) {
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 110 to equal 90

[Killed] EqualityOperator
src/main/calculator.js:19:7
   const discountAmount = price * discountRate
   const finalPrice = price - discountAmount
 
-  if (finalPrice < 0) {
+  if (finalPrice >= 0) {
     return 0
   }
killedBy: api POST /api/calculate calculates pricing
statusReason: expected +0 to equal 90

[Killed] BlockStatement
src/main/calculator.js:19:23
   const discountAmount = price * discountRate
   const finalPrice = price - discountAmount
 
-  if (finalPrice < 0) {
-    return 0
-  }
+  if (finalPrice < 0) {}
 
   return finalPrice
killedBy: calculateDiscount returns zero when discount makes price negative
statusReason: expected -50 to equal +0
