[Killed] BlockStatement
src/main/invoice.js:5:67
 import { calculateDiscount } from './calculator.js'
 import { calculateTotalWithTax } from './tax.js'
 
-function calculateInvoiceTotal ({ price, discountRate, taxRate }) {
-  assertNonNegative(price, 'price')
-
-  const discounted = calculateDiscount(price, discountRate)
-  return calculateTotalWithTax(discounted, taxRate)
-}
+function calculateInvoiceTotal ({ price, discountRate, taxRate }) {}
 
 export { calculateInvoiceTotal }
killedBy: api POST /api/calculate calculates pricing
statusReason: expected undefined to equal 96.3

[Killed] StringLiteral
src/main/invoice.js:6:28
 import { calculateTotalWithTax } from './tax.js'
 
 function calculateInvoiceTotal ({ price, discountRate, taxRate }) {
-  assertNonNegative(price, 'price')
+  assertNonNegative(price, "")
 
   const discounted = calculateDiscount(price, discountRate)
killedBy: invoice rejects negative price
statusReason: expected [Function] to throw error including 'price must be >= 0' but got ' must be >= 0'
