[Killed] BlockStatement
src/main/services/pricingService.js:5:41
 import { calculateDiscount } from '../calculator.js'
 import { calculateInvoiceTotal } from '../invoice.js'
 
-function parseFloatStrict (value, name) {
-  const num = typeof value === 'number' ? value : Number.parseFloat(value)
-  assertNumber(num, name)
-  return num
-}
+function parseFloatStrict (value, name) {}
 
 function calculatePricing ({ price, discountRate, taxRate }) {
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] EqualityOperator
src/main/services/pricingService.js:6:15
 import { calculateInvoiceTotal } from '../invoice.js'
 
 function parseFloatStrict (value, name) {
-  const num = typeof value === 'number' ? value : Number.parseFloat(value)
+  const num = typeof value !== 'number' ? value : Number.parseFloat(value)
   assertNumber(num, name)
   return num
killedBy: pricingService returns discountedPrice and invoiceTotal
statusReason: price must be a valid number

[Killed] ConditionalExpression
src/main/services/pricingService.js:6:15
 import { calculateInvoiceTotal } from '../invoice.js'
 
 function parseFloatStrict (value, name) {
-  const num = typeof value === 'number' ? value : Number.parseFloat(value)
+  const num = true ? value : Number.parseFloat(value)
   assertNumber(num, name)
   return num
killedBy: pricingService returns discountedPrice and invoiceTotal
statusReason: price must be a valid number

[Killed] BlockStatement
src/main/services/pricingService.js:11:62
   return num
 }
 
-function calculatePricing ({ price, discountRate, taxRate }) {
-  const p = parseFloatStrict(price, 'price')
-  const d = parseFloatStrict(discountRate, 'discountRate')
-  const t = parseFloatStrict(taxRate, 'taxRate')
-
-  const discountedPrice = calculateDiscount(p, d)
-  const invoiceTotal = calculateInvoiceTotal({ price: p, discountRate: d, taxRate: t })
-
-  return {
-    input: { price: p, discountRate: d, taxRate: t },
-    discountedPrice,
-    invoiceTotal
-  }
-}
+function calculatePricing ({ price, discountRate, taxRate }) {}
 
 export { calculatePricing }
killedBy: api POST /api/calculate calculates pricing
statusReason: Cannot read properties of undefined (reading 'discountedPrice')

[Survived] StringLiteral
src/main/services/pricingService.js:14:39
 function calculatePricing ({ price, discountRate, taxRate }) {
   const p = parseFloatStrict(price, 'price')
   const d = parseFloatStrict(discountRate, 'discountRate')
-  const t = parseFloatStrict(taxRate, 'taxRate')
+  const t = parseFloatStrict(taxRate, "")
 
   const discountedPrice = calculateDiscount(p, d)

[Killed] ObjectLiteral
src/main/services/pricingService.js:19:10
   const discountedPrice = calculateDiscount(p, d)
   const invoiceTotal = calculateInvoiceTotal({ price: p, discountRate: d, taxRate: t })
 
-  return {
-    input: { price: p, discountRate: d, taxRate: t },
-    discountedPrice,
-    invoiceTotal
-  }
+  return {}
 }
 
killedBy: api POST /api/calculate calculates pricing
statusReason: expected undefined to equal 90
