[Killed] BlockStatement
src/main/tax.js:3:43
 import { assertNonNegative, assertInRangeInclusive } from './validator.js'
 
-function calculateTax (subtotal, taxRate) {
-  assertNonNegative(subtotal, 'subtotal')
-  assertInRangeInclusive(taxRate, 'taxRate', 0, 1)
-  return subtotal * taxRate
-}
+function calculateTax (subtotal, taxRate) {}
 
 function calculateTotalWithTax (subtotal, taxRate) {
killedBy: api POST /api/calculate calculates pricing
statusReason: expected null to equal 96.3

[Killed] ArithmeticOperator
src/main/tax.js:6:10
 function calculateTax (subtotal, taxRate) {
   assertNonNegative(subtotal, 'subtotal')
   assertInRangeInclusive(taxRate, 'taxRate', 0, 1)
-  return subtotal * taxRate
+  return subtotal / taxRate
 }
 
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 1375.7142857142856 to equal 96.3

[Killed] BlockStatement
src/main/tax.js:9:52
   return subtotal * taxRate
 }
 
-function calculateTotalWithTax (subtotal, taxRate) {
-  return subtotal + calculateTax(subtotal, taxRate)
-}
+function calculateTotalWithTax (subtotal, taxRate) {}
 
 export { calculateTax, calculateTotalWithTax }
killedBy: api POST /api/calculate calculates pricing
statusReason: expected undefined to equal 96.3

[Killed] ArithmeticOperator
src/main/tax.js:10:10
 }
 
 function calculateTotalWithTax (subtotal, taxRate) {
-  return subtotal + calculateTax(subtotal, taxRate)
+  return subtotal - calculateTax(subtotal, taxRate)
 }
 
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 83.7 to equal 96.3
