[Killed] BlockStatement
src/main/validator.js:1:37
-function assertNumber (value, name) {
-  if (typeof value !== 'number' || Number.isNaN(value)) {
-    throw new TypeError(`${name} must be a valid number`)
-  }
-}
+function assertNumber (value, name) {}
 
 function assertNonNegative (value, name) {
killedBy: api POST /api/calculate returns 400 on invalid payload
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] EqualityOperator
src/main/validator.js:2:7
 function assertNumber (value, name) {
-  if (typeof value !== 'number' || Number.isNaN(value)) {
+  if (typeof value === 'number' || Number.isNaN(value)) {
     throw new TypeError(`${name} must be a valid number`)
   }
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] LogicalOperator
src/main/validator.js:2:7
 function assertNumber (value, name) {
-  if (typeof value !== 'number' || Number.isNaN(value)) {
+  if (typeof value !== 'number' && Number.isNaN(value)) {
     throw new TypeError(`${name} must be a valid number`)
   }
killedBy: api POST /api/calculate returns 400 on invalid payload
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] BlockStatement
src/main/validator.js:7:42
   }
 }
 
-function assertNonNegative (value, name) {
-  assertNumber(value, name)
-  if (value < 0) {
-    throw new RangeError(`${name} must be >= 0`)
-  }
-}
+function assertNonNegative (value, name) {}
 
 function assertInRangeInclusive (value, name, min, max) {
killedBy: invoice rejects negative price
statusReason: expected [Function] to throw error including 'price must be >= 0' but got 'Price cannot be negative'

[Killed] BlockStatement
src/main/validator.js:9:18
 
 function assertNonNegative (value, name) {
   assertNumber(value, name)
-  if (value < 0) {
-    throw new RangeError(`${name} must be >= 0`)
-  }
+  if (value < 0) {}
 }
 
killedBy: invoice rejects negative price
statusReason: expected [Function] to throw error including 'price must be >= 0' but got 'Price cannot be negative'

[Killed] ConditionalExpression
src/main/validator.js:9:7
 
 function assertNonNegative (value, name) {
   assertNumber(value, name)
-  if (value < 0) {
+  if (true) {
     throw new RangeError(`${name} must be >= 0`)
   }
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] StringLiteral
src/main/validator.js:10:26
 function assertNonNegative (value, name) {
   assertNumber(value, name)
   if (value < 0) {
-    throw new RangeError(`${name} must be >= 0`)
+    throw new RangeError(``)
   }
 }
killedBy: invoice rejects negative price
statusReason: expected [Function] to throw error including 'price must be >= 0' but got ''

[Killed] BlockStatement
src/main/validator.js:14:57
   }
 }
 
-function assertInRangeInclusive (value, name, min, max) {
-  assertNumber(value, name)
-  if (value < min || value > max) {
-    throw new RangeError(`${name} must be between ${min} and ${max}`)
-  }
-}
+function assertInRangeInclusive (value, name, min, max) {}
 
 export { assertNumber, assertNonNegative, assertInRangeInclusive }
killedBy: tax rejects invalid taxRate
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/main/validator.js:16:7
 
 function assertInRangeInclusive (value, name, min, max) {
   assertNumber(value, name)
-  if (value < min || value > max) {
+  if (true) {
     throw new RangeError(`${name} must be between ${min} and ${max}`)
   }
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] EqualityOperator
src/main/validator.js:16:7
 
 function assertInRangeInclusive (value, name, min, max) {
   assertNumber(value, name)
-  if (value < min || value > max) {
+  if (value >= min || value > max) {
     throw new RangeError(`${name} must be between ${min} and ${max}`)
   }
killedBy: api POST /api/calculate calculates pricing
statusReason: expected 200 "OK", got 400 "Bad Request"
